sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/setEntry.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.setentry">
   <soapenv:Header/>
   <soapenv:Body>
   	 <sug:appUri>https://ancexg1011.trial.sugarcrm.com/soap.php</sug:appUri>
   	 <sug:sessionId>q984o1b919qfktlkmktlgjbmd0</sug:sessionId>
   	 <sug:moduleName>Calls</sug:moduleName>
   	 <sug:nameValueList>
         <nameValue>
		  <name>name</name>
		  <value>DEMOUSER1234_123-MMM222</value>
	    </nameValue>
      </sug:nameValueList>   	
   </soapenv:Body>
</soapenv:Envelope>